# ------------------------------------第一   载入库----------------------------------
import time
# ------------------------------------第二   主程序----------------------------------
print('欢迎来到万和超市商品录入与查询系统！\n******请登录*******')
print('--------------------请输入-------------------')
m1 = input('||账号   :||',)                                       # 输入账号(2022003221)
m2 = input('||密码   :||',)                                       # 输入密码(cmh1314521)
m3 = input('||验证码 :||',)                                       # 输入验证码(CHAJ)
sum = 0
list1 = []                                                        # 用于装货物名，用于电子票据的输出
list2 = []                                                        # 用于装货价格，用于电子票据的输出

if m1 == '2022003221' and m2 == 'cmh1314521' and m3 == 'CHAJ':

    print('登录成功!\n请在主菜单界面选择功能')
    i = input('主菜单：\t1--录入商品\t2--商品扫码查询\t3--收银\t4--退出\n')
    c = {}                          # 创建字典
    while i == '1' or '2' or '3':   # 创建循环
        if i == '1':
            # 1 -- 录入商品（创建字典）           
            list = [] # 创建列表，用于装商品信息
            code = input('请输入号码（扫码条形码）：')  # 作为字典中的键
            name = input('请输入商品名称（品名）：')
            price = input('请输入商品价格（单价）：')
            list.append(name)   # 将商品名与商品单价添加到一共列表中，作为字典中的值
            list.append(price)
            c[code] = list       # 将元素添加到字典中
             
            i = input('\n该商品已录入成功，返回主菜单选择接下来的操作\n主菜单：\t1--录入商品\t2--商品扫码查询\t3--收银\t4--退出\n')

        if i == '2':
            # 2 -- 商品扫码查询（在字典中查找）
            code = input('请输入号码：')
            print('商品信息如下：',c[code] if code in c else '该商品未录入')
            i = input('\n该查询完成，返回主菜单选择接下来的操作\n主菜单：\t1--录入商品\t2--商品扫码查询\t3--收银\t4--退出\n')

        if i == '3':
            an = ''
            while an == '':
                code = input('请输入号码：')
                v = c[code]            # 获取值
                list1.append(v[0])     # 用于装货物名，用于电子票据的输出
                list2.append(v[1])     # 用于装货价格，用于电子票据的输出
                print('当前货物名为：{}'.format(v[0]))
                print('当前货物价格为：{}'.format(v[1]))
                sum += float(v[1])
                print('\n小计：{:.2f}元'.format(sum))
                an = input('继续吗？')
                print('')
            print('请付费：{:.2f}元'.format(sum))
            code = input('请出示付款码！')
            while ((len(code) != 18) or (code[0:2] not in {'10','11','12','13','14','15'})):
                code = input ('付款码有误，请出示付款码！')
            now = time.strftime("%Y-%m-%d %H:%M:%S",time.localtime())
            print('支付成功，谢谢！\n请查看您的电子小票')
            print('________________________________________')
            print('|                                      |')
            print('|               万和超市               |')
            print('|                                      |')
            print('|单据号：036200105724                  |')
            print('|机器编号：30575470                    |')
            print('|买单时间：{}         |'.format(now))
            print('|                                      |')
            print('|商品                             金额 |')
            print('|--------------------------------------|')
            for i in range(len(list1)):
                print('|{:<9s}                   {:>5}|'.format(list1[i],list[i]))
            print('|合计：{:<2}件              应收:{:>9}|'.format(len(list1),sum))
            print('|--------------------------------------|')
            print('|实收金额：{:<9}                   |'.format(str(sum)))
            print('|本单折扣：0.00       舍分：0.00       |')
            print('|交易流水：3017036200102624000001      |')
            print('|中心流水：61672281295360001           |')
            print('|劵支付合计：0.00                      |')
            print('|不找零金额：0.00                      |')
            print('|                                      |')
            print('|______________________________________|')          
            i = input('\n该收银完成，返回主菜单选择接下来的操作\n主菜单：\t1--录入商品\t2--商品扫码查询\t3--收银\t4--退出\n')
            
           
        if i == '4':
            # 4 -- 退出
            print('超市商品系统已退出！')
            break  # break语句跳出循环

else:
    print('账号/密码/验证码输入错误！程序结束运行！')
