#-----------------第一 载入库-----------------------
import random as rd
#-----------------第二 数据索引---------------------
#-----------------第三 子函数定义-------------------
#-----------------第四 主程序-----------------------
k='y'
while(k=='y'):
    # 生成一个随机数
    a=rd.randint(1,99)
    count=1   #记一下次数
    print("电脑已经想好了一个1到100的数字")#提醒玩家准备开始了
    #print("电脑想的数字是%d"%a)
    for i in range(9):  #最多循环九次
        x=int(input("接下来请输入你猜的数字:"))#开始让玩家猜数字
        if x>a:
            print("你猜的数大了哦，再来一次吧。")
        elif x<a:
            print("你猜的数小了哦，再试一次")
        else:
            break
        count+=1
    if count<=5 and x==a:
        print("天才哦，这么快就猜中了!(优秀)")
    elif 5<count<=7 and x==a:
        print("很棒哦!(良好)")
    elif 8<=count<=9 and x==a:
        print("猜的次数有点多了哦!(一般)")
    elif count!=9 and x!=a:
        print("游戏结束你没猜中，真笨啊!(很差)")
        print("电脑想的数字是%d"%a)
    print("你用了%d次机会"%count)
    k=input("下一个人接着玩吗?(继续/y)结束(n)")
    
                                  
