
#--------------------------第一载入库-----------------------------
import random

#-----------------------第二  数据索引-------------------------------
list1 = ["☼","☽","☆","☾","¤","§","♊","♉","♈","♎","♌","♏","♓","❉"]               #显示这些图案


#-------------------------第四主程序---------------------------------------
count = 0                                         #初值为0
ran_num = random.randint(0,len(list1)-1)         #从列表十四个元素里边挑一个随机数
ran =  list1.pop(ran_num)                       # 弹出列表里的某一个图案，每次都随机，这个数就是上句挑出来的那个随机数
for i in range(1,100):
    if i > 1 and i % 9 == 0:                        #所有九的倍数显示一个图案，显示的就是列表里ran_num+1对应的那号元素
        print(str(i) + ran,end="\t\t")
        count += 1
    else:
        print(str(i) + list1[random.randint(0,len(list1)-1)],end="\t\t")    #剩下非九的倍数显示的图案随机，
        count += 1
    if count % 20 == 0:
        print()
print("脑海中想一个两位数，用此数减去 (个位+十位的和) 得到一个数，记住它对应的图案，我将读出你心中的图案")
print("*" * 80)
key_in = input("按回车键开始读心：")
print()
print("你心中的图案是：" + ran)
                                          
